_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 226, 226, 3)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 112, 112, 32)      864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 112, 112, 32)      128       
_________________________________________________________________
conv1_relu (Activation)      (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pad_1 (ZeroPadding2D)   (None, 114, 114, 32)      0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 112, 112, 32)      288       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 112, 112, 32)      128       
_________________________________________________________________
conv_dw_1_relu (Activation)  (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 112, 112, 64)      2048      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 112, 112, 64)      256       
_________________________________________________________________
conv_pw_1_relu (Activation)  (None, 112, 112, 64)      0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 114, 114, 64)      0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 56, 56, 64)        576       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 56, 56, 64)        256       
_________________________________________________________________
conv_dw_2_relu (Activation)  (None, 56, 56, 64)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 56, 56, 128)       8192      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_2_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_3 (ZeroPadding2D)   (None, 58, 58, 128)       0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 56, 56, 128)       1152      
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_dw_3_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 56, 56, 128)       16384     
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_3_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 58, 58, 128)       0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 28, 28, 128)       1152      
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 28, 28, 128)       512       
_________________________________________________________________
conv_dw_4_relu (Activation)  (None, 28, 28, 128)       0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 28, 28, 256)       32768     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_4_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_5 (ZeroPadding2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 28, 28, 256)       2304      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_dw_5_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 28, 28, 256)       65536     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_5_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 14, 14, 256)       2304      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 14, 14, 256)       1024      
_________________________________________________________________
conv_dw_6_relu (Activation)  (None, 14, 14, 256)       0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 14, 14, 512)       131072    
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_6_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_7 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_7_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_7_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_8 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_8_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_8_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_9 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_9_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_9_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_10 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_10_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_10_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_11 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_11_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_11_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 7, 7, 512)         4608      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 7, 7, 512)         2048      
_________________________________________________________________
conv_dw_12_relu (Activation) (None, 7, 7, 512)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 7, 7, 1024)        524288    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_12_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pad_13 (ZeroPadding2D)  (None, 9, 9, 1024)        0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 7, 7, 1024)        9216      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_dw_13_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 7, 7, 1024)        1048576   
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_13_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 2050      
=================================================================
Total params: 4,280,514
Trainable params: 4,258,626
Non-trainable params: 21,888
_________________________________________________________________
<keras.engine.input_layer.InputLayer object at 0x7f08a733c810> False
<keras.layers.convolutional.ZeroPadding2D object at 0x7f08a733ca90> True
<keras.layers.convolutional.Conv2D object at 0x7f08a733cb10> True
<keras.layers.normalization.BatchNormalization object at 0x7f08a733cb50> True
<keras.layers.core.Activation object at 0x7f08a733cc90> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f08a72aad90> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f08a72de710> True
<keras.layers.normalization.BatchNormalization object at 0x7f08a7270290> True
<keras.layers.core.Activation object at 0x7f08a72de110> True
<keras.layers.convolutional.Conv2D object at 0x7f08a721d550> True
<keras.layers.normalization.BatchNormalization object at 0x7f08a721d210> True
<keras.layers.core.Activation object at 0x7f087c7f0dd0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f087c787210> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f087c7cf450> True
<keras.layers.normalization.BatchNormalization object at 0x7f087c750890> True
<keras.layers.core.Activation object at 0x7f087c3e1e10> True
<keras.layers.convolutional.Conv2D object at 0x7f087c342d90> True
<keras.layers.normalization.BatchNormalization object at 0x7f087c3e9410> True
<keras.layers.core.Activation object at 0x7f087c3a3890> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f087c1cad10> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f087c371a10> True
<keras.layers.normalization.BatchNormalization object at 0x7f087c228450> True
<keras.layers.core.Activation object at 0x7f087c371990> True
<keras.layers.convolutional.Conv2D object at 0x7f087c1fad90> True
<keras.layers.normalization.BatchNormalization object at 0x7f087c1faa10> True
<keras.layers.core.Activation object at 0x7f087c1b3910> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f087c002f90> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f087c002f50> True
<keras.layers.normalization.BatchNormalization object at 0x7f087c038a50> True
<keras.layers.core.Activation object at 0x7f087c02bfd0> True
<keras.layers.convolutional.Conv2D object at 0x7f086a312590> True
<keras.layers.normalization.BatchNormalization object at 0x7f086a312050> True
<keras.layers.core.Activation object at 0x7f086a2cd210> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f086a172c90> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f086a29ce90> True
<keras.layers.normalization.BatchNormalization object at 0x7f086a154350> True
<keras.layers.core.Activation object at 0x7f086a29c790> True
<keras.layers.convolutional.Conv2D object at 0x7f086a11fd10> True
<keras.layers.normalization.BatchNormalization object at 0x7f086a11f990> True
<keras.layers.core.Activation object at 0x7f086a0d78d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f0869fa8f50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f0869fa8e50> True
<keras.layers.normalization.BatchNormalization object at 0x7f0869f5fa10> True
<keras.layers.core.Activation object at 0x7f0869f53f90> True
<keras.layers.convolutional.Conv2D object at 0x7f0869e35550> True
<keras.layers.normalization.BatchNormalization object at 0x7f0869e35210> True
<keras.layers.core.Activation object at 0x7f0869ded1d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f0869c11c50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f0869cbbe90> True
<keras.layers.normalization.BatchNormalization object at 0x7f0869c73310> True
<keras.layers.core.Activation object at 0x7f0869cbb750> True
<keras.layers.convolutional.Conv2D object at 0x7f0869c42cd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f0869c42950> True
<keras.layers.core.Activation object at 0x7f0869afc890> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f0869a49f10> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f0869a49e10> True
<keras.layers.normalization.BatchNormalization object at 0x7f0869a7f9d0> True
<keras.layers.core.Activation object at 0x7f0869a72fd0> True
<keras.layers.convolutional.Conv2D object at 0x7f08698d7510> True
<keras.layers.normalization.BatchNormalization object at 0x7f08698d7910> True
<keras.layers.core.Activation object at 0x7f086988f190> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f0869731c10> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f086975bb90> True
<keras.layers.normalization.BatchNormalization object at 0x7f08697142d0> True
<keras.layers.core.Activation object at 0x7f086975b710> True
<keras.layers.convolutional.Conv2D object at 0x7f08696e4c90> True
<keras.layers.normalization.BatchNormalization object at 0x7f08696e4910> True
<keras.layers.core.Activation object at 0x7f086959c8d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f086956cfd0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f086956cdd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f0869521990> True
<keras.layers.core.Activation object at 0x7f0869516f90> True
<keras.layers.convolutional.Conv2D object at 0x7f08693f4bd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f08693f4190> True
<keras.layers.core.Activation object at 0x7f08693ae450> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f086937de50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f086937d050> True
<keras.layers.normalization.BatchNormalization object at 0x7f0869235390> True
<keras.layers.core.Activation object at 0x7f086922bb10> True
<keras.layers.convolutional.Conv2D object at 0x7f0869204d90> True
<keras.layers.normalization.BatchNormalization object at 0x7f08692047d0> True
<keras.layers.core.Activation object at 0x7f08691bcb10> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f086900ecd0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f086900e6d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f0869045bd0> True
<keras.layers.core.Activation object at 0x7f086903ced0> True
<keras.layers.convolutional.Conv2D object at 0x7f0868eaf850> True
<keras.layers.normalization.BatchNormalization object at 0x7f0868e93e50> True
<keras.layers.core.Activation object at 0x7f0868e76c90> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f0868cfec50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f0868e4bed0> True
<keras.layers.normalization.BatchNormalization object at 0x7f0868cd38d0> True
<keras.layers.core.Activation object at 0x7f0868e0d310> True
<keras.layers.convolutional.Conv2D object at 0x7f0868cabf90> True
<keras.layers.normalization.BatchNormalization object at 0x7f0868cab9d0> True
<keras.layers.core.Activation object at 0x7f0868b3ae50> True
<keras.layers.pooling.GlobalAveragePooling2D object at 0x7f0868ae9e90> True
<keras.layers.core.Dense object at 0x7f08536966d0> True
<keras.layers.core.Dense object at 0x7f08536ac690> True
Found 86855 images belonging to 2 classes.
Found 18757 images belonging to 2 classes.
start training time =  2018-06-21 13:55:08.790025
Epoch 1/20
 - 3027s - loss: 0.0037 - acc: 0.9991 - val_loss: 9.6911e-04 - val_acc: 0.9999
Epoch 2/20
 - 3015s - loss: 3.7189e-04 - acc: 1.0000 - val_loss: 3.8953e-07 - val_acc: 1.0000
Epoch 3/20
 - 3016s - loss: 6.7760e-04 - acc: 0.9999 - val_loss: 1.7644e-07 - val_acc: 1.0000
Epoch 4/20
 - 3004s - loss: 3.7397e-04 - acc: 1.0000 - val_loss: 3.0465e-06 - val_acc: 1.0000
Epoch 5/20
 - 3004s - loss: 4.5557e-04 - acc: 1.0000 - val_loss: 1.8644e-04 - val_acc: 0.9999
Epoch 6/20
 - 3005s - loss: 1.3928e-04 - acc: 1.0000 - val_loss: 5.6936e-05 - val_acc: 0.9999
Epoch 7/20
 - 3004s - loss: 1.9534e-05 - acc: 1.0000 - val_loss: 1.3986e-07 - val_acc: 1.0000
Epoch 8/20
 - 3006s - loss: 1.6928e-04 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 9/20
 - 3006s - loss: 1.0808e-06 - acc: 1.0000 - val_loss: 1.2083e-07 - val_acc: 1.0000
Epoch 10/20
 - 3007s - loss: 2.5339e-04 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 11/20
 - 3000s - loss: 1.1924e-07 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 12/20
 - 3005s - loss: 1.1921e-07 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 13/20
 - 3004s - loss: 3.5650e-05 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 14/20
 - 3007s - loss: 1.4690e-07 - acc: 1.0000 - val_loss: 1.3646e-07 - val_acc: 1.0000
Epoch 15/20
 - 3007s - loss: 1.2642e-06 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 16/20
 - 3005s - loss: 1.7332e-07 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 17/20
 - 3006s - loss: 1.1926e-07 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 18/20
 - 3006s - loss: 1.1944e-07 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 19/20
 - 3000s - loss: 1.1928e-07 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 20/20
 - 3006s - loss: 1.1921e-07 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
end training time =  2018-06-22 06:37:33.146527
Found 18757 images belonging to 2 classes.
No of errors = 1/18757
