_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 226, 226, 3)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 112, 112, 32)      864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 112, 112, 32)      128       
_________________________________________________________________
conv1_relu (Activation)      (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pad_1 (ZeroPadding2D)   (None, 114, 114, 32)      0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 112, 112, 32)      288       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 112, 112, 32)      128       
_________________________________________________________________
conv_dw_1_relu (Activation)  (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 112, 112, 64)      2048      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 112, 112, 64)      256       
_________________________________________________________________
conv_pw_1_relu (Activation)  (None, 112, 112, 64)      0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 114, 114, 64)      0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 56, 56, 64)        576       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 56, 56, 64)        256       
_________________________________________________________________
conv_dw_2_relu (Activation)  (None, 56, 56, 64)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 56, 56, 128)       8192      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_2_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_3 (ZeroPadding2D)   (None, 58, 58, 128)       0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 56, 56, 128)       1152      
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_dw_3_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 56, 56, 128)       16384     
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_3_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 58, 58, 128)       0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 28, 28, 128)       1152      
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 28, 28, 128)       512       
_________________________________________________________________
conv_dw_4_relu (Activation)  (None, 28, 28, 128)       0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 28, 28, 256)       32768     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_4_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_5 (ZeroPadding2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 28, 28, 256)       2304      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_dw_5_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 28, 28, 256)       65536     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_5_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 14, 14, 256)       2304      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 14, 14, 256)       1024      
_________________________________________________________________
conv_dw_6_relu (Activation)  (None, 14, 14, 256)       0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 14, 14, 512)       131072    
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_6_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_7 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_7_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_7_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_8 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_8_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_8_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_9 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_9_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_9_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_10 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_10_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_10_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_11 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_11_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_11_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 7, 7, 512)         4608      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 7, 7, 512)         2048      
_________________________________________________________________
conv_dw_12_relu (Activation) (None, 7, 7, 512)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 7, 7, 1024)        524288    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_12_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pad_13 (ZeroPadding2D)  (None, 9, 9, 1024)        0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 7, 7, 1024)        9216      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_dw_13_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 7, 7, 1024)        1048576   
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_13_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 4100      
=================================================================
Total params: 4,282,564
Trainable params: 4,260,676
Non-trainable params: 21,888
_________________________________________________________________
<keras.engine.input_layer.InputLayer object at 0x7f3b9b4ba750> False
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b9b4ba9d0> True
<keras.layers.convolutional.Conv2D object at 0x7f3b9b4baa50> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b9b4baa90> True
<keras.layers.core.Activation object at 0x7f3b9b4babd0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b9b460110> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b9b460650> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b9b4387d0> True
<keras.layers.core.Activation object at 0x7f3b9b42ee50> True
<keras.layers.convolutional.Conv2D object at 0x7f3b9808f490> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b9808f890> True
<keras.layers.core.Activation object at 0x7f3b98071d10> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b70698150> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b98048c10> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b7065f7d0> True
<keras.layers.core.Activation object at 0x7f3b7062cd50> True
<keras.layers.convolutional.Conv2D object at 0x7f3b70182cd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b70635350> True
<keras.layers.core.Activation object at 0x7f3b701e47d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b70008c50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b701b1950> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b7016a390> True
<keras.layers.core.Activation object at 0x7f3b701b18d0> True
<keras.layers.convolutional.Conv2D object at 0x7f3b70039cd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b70039950> True
<keras.layers.core.Activation object at 0x7f3b6b7f38d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b6b641fd0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b6b641dd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6b677990> True
<keras.layers.core.Activation object at 0x7f3b6b66cf90> True
<keras.layers.convolutional.Conv2D object at 0x7f3b6b5c94d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6b5c98d0> True
<keras.layers.core.Activation object at 0x7f3b6b485150> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b6b452ed0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b6b4520d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6b40b450> True
<keras.layers.core.Activation object at 0x7f3b6b47dc10> True
<keras.layers.convolutional.Conv2D object at 0x7f3b6b2d6c50> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6b2d68d0> True
<keras.layers.core.Activation object at 0x7f3b6b28e890> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b6b15ef90> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b6b15ed90> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6b115950> True
<keras.layers.core.Activation object at 0x7f3b6b10afd0> True
<keras.layers.convolutional.Conv2D object at 0x7f3b6afeb490> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6afeb890> True
<keras.layers.core.Activation object at 0x7f3b6afa3110> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b6af73e90> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b6af73090> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6ae2b250> True
<keras.layers.core.Activation object at 0x7f3b6ae1fbd0> True
<keras.layers.convolutional.Conv2D object at 0x7f3b6adf7c10> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6adf7890> True
<keras.layers.core.Activation object at 0x7f3b6adb3850> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b6ac7ef50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b6ac7ed50> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6ac35910> True
<keras.layers.core.Activation object at 0x7f3b6ac29f90> True
<keras.layers.convolutional.Conv2D object at 0x7f3b6aa8c450> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6aa8c850> True
<keras.layers.core.Activation object at 0x7f3b6aa45090> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b6aa12e50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b6aa12050> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6a8cb210> True
<keras.layers.core.Activation object at 0x7f3b6a8c0b90> True
<keras.layers.convolutional.Conv2D object at 0x7f3b6a89abd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6a89a850> True
<keras.layers.core.Activation object at 0x7f3b6a851810> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b6a723e10> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b6a723810> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6a6d88d0> True
<keras.layers.core.Activation object at 0x7f3b6a6cff50> True
<keras.layers.convolutional.Conv2D object at 0x7f3b6a6acf90> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6a6ac0d0> True
<keras.layers.core.Activation object at 0x7f3b6a505e90> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b6a519510> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b6a55cc50> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6a4ec450> True
<keras.layers.core.Activation object at 0x7f3b6a4e2a50> True
<keras.layers.convolutional.Conv2D object at 0x7f3b6a3b9cd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6a3b9710> True
<keras.layers.core.Activation object at 0x7f3b6a371a50> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b6a1c3c10> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b6a1c3610> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6a1fbb10> True
<keras.layers.core.Activation object at 0x7f3b6a1f1e10> True
<keras.layers.convolutional.Conv2D object at 0x7f3b6a152090> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b6a14ad90> True
<keras.layers.core.Activation object at 0x7f3b6a0025d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f3b69ff0850> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f3b69fdd1d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b69f8b250> True
<keras.layers.core.Activation object at 0x7f3b69fdd2d0> True
<keras.layers.convolutional.Conv2D object at 0x7f3b69e61ed0> True
<keras.layers.normalization.BatchNormalization object at 0x7f3b69e61910> True
<keras.layers.core.Activation object at 0x7f3b69e1aa90> True
<keras.layers.pooling.GlobalAveragePooling2D object at 0x7f3b69ca2e50> True
<keras.layers.core.Dense object at 0x7f3b68881fd0> True
<keras.layers.core.Dense object at 0x7f3b68885610> True
Found 94397 images belonging to 4 classes.
