_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 226, 226, 3)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 112, 112, 32)      864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 112, 112, 32)      128       
_________________________________________________________________
conv1_relu (Activation)      (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pad_1 (ZeroPadding2D)   (None, 114, 114, 32)      0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 112, 112, 32)      288       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 112, 112, 32)      128       
_________________________________________________________________
conv_dw_1_relu (Activation)  (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 112, 112, 64)      2048      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 112, 112, 64)      256       
_________________________________________________________________
conv_pw_1_relu (Activation)  (None, 112, 112, 64)      0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 114, 114, 64)      0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 56, 56, 64)        576       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 56, 56, 64)        256       
_________________________________________________________________
conv_dw_2_relu (Activation)  (None, 56, 56, 64)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 56, 56, 128)       8192      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_2_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_3 (ZeroPadding2D)   (None, 58, 58, 128)       0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 56, 56, 128)       1152      
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_dw_3_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 56, 56, 128)       16384     
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_3_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 58, 58, 128)       0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 28, 28, 128)       1152      
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 28, 28, 128)       512       
_________________________________________________________________
conv_dw_4_relu (Activation)  (None, 28, 28, 128)       0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 28, 28, 256)       32768     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_4_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_5 (ZeroPadding2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 28, 28, 256)       2304      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_dw_5_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 28, 28, 256)       65536     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_5_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 14, 14, 256)       2304      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 14, 14, 256)       1024      
_________________________________________________________________
conv_dw_6_relu (Activation)  (None, 14, 14, 256)       0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 14, 14, 512)       131072    
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_6_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_7 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_7_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_7_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_8 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_8_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_8_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_9 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_9_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_9_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_10 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_10_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_10_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_11 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_11_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_11_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 7, 7, 512)         4608      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 7, 7, 512)         2048      
_________________________________________________________________
conv_dw_12_relu (Activation) (None, 7, 7, 512)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 7, 7, 1024)        524288    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_12_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pad_13 (ZeroPadding2D)  (None, 9, 9, 1024)        0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 7, 7, 1024)        9216      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_dw_13_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 7, 7, 1024)        1048576   
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_13_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 4100      
=================================================================
Total params: 4,282,564
Trainable params: 4,260,676
Non-trainable params: 21,888
_________________________________________________________________
<keras.engine.input_layer.InputLayer object at 0x7f9731a7a690> False
<keras.layers.convolutional.ZeroPadding2D object at 0x7f9731a7a910> True
<keras.layers.convolutional.Conv2D object at 0x7f9731a7a990> True
<keras.layers.normalization.BatchNormalization object at 0x7f9731a7a9d0> True
<keras.layers.core.Activation object at 0x7f9731a7ab10> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f9731a22050> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f9731a22590> True
<keras.layers.normalization.BatchNormalization object at 0x7f97317f7710> True
<keras.layers.core.Activation object at 0x7f97317edd90> True
<keras.layers.convolutional.Conv2D object at 0x7f9730070e90> True
<keras.layers.normalization.BatchNormalization object at 0x7f973006f3d0> True
<keras.layers.core.Activation object at 0x7f9730054c50> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f97200340d0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f9730028d50> True
<keras.layers.normalization.BatchNormalization object at 0x7f970c49bcd0> True
<keras.layers.core.Activation object at 0x7f970c49b810> True
<keras.layers.convolutional.Conv2D object at 0x7f970c1c2c10> True
<keras.layers.normalization.BatchNormalization object at 0x7f970c471290> True
<keras.layers.core.Activation object at 0x7f970c42b710> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f970c1f1890> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f970c1f1390> True
<keras.layers.normalization.BatchNormalization object at 0x7f970c1aa2d0> True
<keras.layers.core.Activation object at 0x7f970c1a1c50> True
<keras.layers.convolutional.Conv2D object at 0x7f970c178c10> True
<keras.layers.normalization.BatchNormalization object at 0x7f970c178890> True
<keras.layers.core.Activation object at 0x7f970c134810> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f970c082e10> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f970c082810> True
<keras.layers.normalization.BatchNormalization object at 0x7f970c0b98d0> True
<keras.layers.core.Activation object at 0x7f970c0aff50> True
<keras.layers.convolutional.Conv2D object at 0x7f970c00a410> True
<keras.layers.normalization.BatchNormalization object at 0x7f970c00a810> True
<keras.layers.core.Activation object at 0x7f97017def10> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f97017f52d0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f97017c1450> True
<keras.layers.normalization.BatchNormalization object at 0x7f97017471d0> True
<keras.layers.core.Activation object at 0x7f970173bb50> True
<keras.layers.convolutional.Conv2D object at 0x7f9701713b90> True
<keras.layers.normalization.BatchNormalization object at 0x7f9701713810> True
<keras.layers.core.Activation object at 0x7f97016ca7d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f970169add0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f970169a7d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f9701652890> True
<keras.layers.core.Activation object at 0x7f9701648fd0> True
<keras.layers.convolutional.Conv2D object at 0x7f9701621e90> True
<keras.layers.normalization.BatchNormalization object at 0x7f97016273d0> True
<keras.layers.core.Activation object at 0x7f9701580e50> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f9701595290> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f97015df410> True
<keras.layers.normalization.BatchNormalization object at 0x7f9701567190> True
<keras.layers.core.Activation object at 0x7f970155eb10> True
<keras.layers.convolutional.Conv2D object at 0x7f9701533b50> True
<keras.layers.normalization.BatchNormalization object at 0x7f97015337d0> True
<keras.layers.core.Activation object at 0x7f97014ee790> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f97014bad90> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f97014ba790> True
<keras.layers.normalization.BatchNormalization object at 0x7f97014718d0> True
<keras.layers.core.Activation object at 0x7f9701465f90> True
<keras.layers.convolutional.Conv2D object at 0x7f97012c0e50> True
<keras.layers.normalization.BatchNormalization object at 0x7f97012c8390> True
<keras.layers.core.Activation object at 0x7f97012a1e10> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f97012b4250> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f97012f8c50> True
<keras.layers.normalization.BatchNormalization object at 0x7f9701106150> True
<keras.layers.core.Activation object at 0x7f97010fcad0> True
<keras.layers.convolutional.Conv2D object at 0x7f97010d7b50> True
<keras.layers.normalization.BatchNormalization object at 0x7f97010d7190> True
<keras.layers.core.Activation object at 0x7f970108f750> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f9700f5dd50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f9700f5d750> True
<keras.layers.normalization.BatchNormalization object at 0x7f9700f15890> True
<keras.layers.core.Activation object at 0x7f9700f0bf50> True
<keras.layers.convolutional.Conv2D object at 0x7f9700ee8250> True
<keras.layers.normalization.BatchNormalization object at 0x7f9700ee2f50> True
<keras.layers.core.Activation object at 0x7f9700d41dd0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f9700d56450> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f9700d99d90> True
<keras.layers.normalization.BatchNormalization object at 0x7f9700d1ec50> True
<keras.layers.core.Activation object at 0x7f9700d1e990> True
<keras.layers.convolutional.Conv2D object at 0x7f9700bf6c10> True
<keras.layers.normalization.BatchNormalization object at 0x7f9700bf6650> True
<keras.layers.core.Activation object at 0x7f9700bae550> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f97009d6f50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f97009ffb50> True
<keras.layers.normalization.BatchNormalization object at 0x7f9700a38610> True
<keras.layers.core.Activation object at 0x7f97009ffa50> True
<keras.layers.convolutional.Conv2D object at 0x7f970088e290> True
<keras.layers.normalization.BatchNormalization object at 0x7f9700885cd0> True
<keras.layers.core.Activation object at 0x7f970083e510> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f9700819110> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f9700819d50> True
<keras.layers.normalization.BatchNormalization object at 0x7f97006c75d0> True
<keras.layers.core.Activation object at 0x7f970082e150> True
<keras.layers.convolutional.Conv2D object at 0x7f970069ee10> True
<keras.layers.normalization.BatchNormalization object at 0x7f970069e850> True
<keras.layers.core.Activation object at 0x7f97006589d0> True
<keras.layers.pooling.GlobalAveragePooling2D object at 0x7f97004dfd90> True
<keras.layers.core.Dense object at 0x7f96f50ade90> True
<keras.layers.core.Dense object at 0x7f96f50b2510> True
Found 94397 images belonging to 4 classes.
Found 16625 images belonging to 4 classes.
train_label2index =  {'car': 0, 'nopeople': 3, 'manypeople': 2, 'fewpeople': 1}
label2index =  {'car': 0, 'nopeople': 3, 'manypeople': 2, 'fewpeople': 1}
start training time =  2018-08-07 19:15:38.509988
Epoch 1/5
 - 3230s - loss: 0.0089 - acc: 0.9972 - val_loss: 0.0061 - val_acc: 0.9989
Epoch 2/5
 - 3208s - loss: 0.0013 - acc: 0.9998 - val_loss: 0.0293 - val_acc: 0.9975
Epoch 3/5
 - 3210s - loss: 6.0681e-04 - acc: 0.9999 - val_loss: 0.0072 - val_acc: 0.9982
Epoch 4/5
 - 3208s - loss: 5.2559e-05 - acc: 1.0000 - val_loss: 0.0187 - val_acc: 0.9977
Epoch 5/5
 - 3210s - loss: 4.7426e-05 - acc: 1.0000 - val_loss: 0.0466 - val_acc: 0.9965
end training time =  2018-08-07 23:43:28.384049
Found 16625 images belonging to 4 classes.
No of errors = 1/16625
